Repository: gitmichaelqiu/DesktopRenamer
Catalog: DesktopRenamer/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: + Number
zh_hans: + 数字

source: (No Title)
zh_hans: （无标题）

source: %@ · Fullscreen
zh_hans: %@ · 全屏

# %@ · Space %lld
source: %1$@ · Space %2$lld
zh_hans: %1$@ · 桌面 %2$lld

source: %lld items
zh_hans: %lld 个项目

source: %lld windows
zh_hans: %lld 个窗口

source: 3 Fingers
zh_hans: 3指

source: 4 Fingers
zh_hans: 4指

source: Accessibility
zh_hans: 辅助功能

source: Accessibility permission not granted
zh_hans: 辅助权限未获取

source: Acknowledgements
zh_hans: 致谢

source: Action
zh_hans: 操作

source: Actions
zh_hans: 操作

source: Active
zh_hans: 活跃

source: Active Space Label
zh_hans: 当前桌面标签

source: Active Space Label: %@
zh_hans: 当前桌面标签：%@

source: Active Space Labels
zh_hans: 当前桌面标签

source: Active Window
zh_hans: 活跃窗口

source: Add App Exception
zh_hans: 添加App特例

source: Add app exception...
zh_hans: 添加App特例...

source: Add Exception
zh_hans: 添加特例

source: Adjust the position where the mouse grabs the window to move across spaces.
zh_hans: 调整鼠标抓窗口的位置，用于将窗口移动到不同桌面。

source: Allow other apps to get space names.
zh_hans: 允许其他应用访问桌面名称。

source: Are you a power user? Integrate directly with Raycast to manage and switch spaces elegantly via your favorite launcher.
zh_hans: 是个高级用户？在 Raycast 内直接控制你的桌面。

source: Are you sure? This will delete all your space names and settings. The app will quit immediately.
zh_hans: 清空所有的桌面和设置。App会立即退出。

source: Automatically download updates
zh_hans: 自动下载更新

source: Automatically rank commands
zh_hans: 自动排序命令

source: Automatically rank commands based on their execution frequency. Turn off to manually reorder commands.
zh_hans: 根据执行频率自动对命令进行排序。关闭以手动调整命令顺序。

source: Automatically return to original space
zh_hans: 自动返回原桌面

source: Automatically return to your original desktop after moving windows to a different desktop.
zh_hans: 在将窗口移动到其他桌面后，自动返回到您原本的桌面。

source: Back
zh_hans: 返回

source: Batch Move Windows
zh_hans: 批量移动窗口

# Button.Cancel
source: Cancel
zh_hans: 取消

# Button.OK
source: OK
zh_hans: 确认

source: By doing so, you can turn DesktopRenamer into a completely silent API app.
zh_hans: 你可以将 DesktopRenamer 设置为纯 API 后台。

source: Bypass native macOS animation lag. Enable trackpad overrides or hotkeys for instant, zero-delay switching.
zh_hans: 修复 macOS 原生桌面切换延迟。启用手势或快捷键覆盖换来更加快捷的切换体验。

source: Cancel
zh_hans: 取消

source: Check out these other productivity tools we've built.
zh_hans: 看看我们所开发的其他效率工具。

source: Choose Application...
zh_hans: 选择App…

source: Click a space in the menu bar to jump right to it. Hold the Option (⌥) key to instantly teleport your active window.
zh_hans: 在菜单中点击一个桌面以直接切换。 长按 Option 键以移动当前窗口。

source: Click to switch, Option+Click to move active window.
zh_hans: 点击切换，Option+点击移动窗口。

source: Close
zh_hans: 关闭

source: Confirm & Execute Batch Move (%lld windows)
zh_hans: 确认 & 执行批量移动 (%lld 个窗口)

source: Control which app and dock to show in each space.
zh_hans: 控制每个桌面的 App 和 Dock。

source: Controls how much distance the fingers have to move before switching the desktop.
zh_hans: 控制触发切换的手指移动距离。

source: Crystal Clear Labels
zh_hans: 桌面标签

source: Cursor
zh_hans: 指针

source: Cursor is on an interactive control (%@)
zh_hans: 光标在App的交互区域(%@)

source: Cursor is too low (likely inside window content area)
zh_hans: 光标太低 (可能在窗口的内容区域)

source: Delete Exception
zh_hans: 删除特例

source: DesktopRenamer requires Accessibility permission for hotkeys and trackpad overrides to function correctly.
zh_hans: DesktopRenamer 需要辅助权限以配置快捷键和触控板覆盖。

source: DesktopRenamer's GitHub
zh_hans: DesktopRenamer的GitHub

source: DesktopRenamer's website
zh_hans: DesktopRenamer的网站

source: Disabled
zh_hans: 已禁用

source: Discover More Apps
zh_hans: 更多 App

source: Done
zh_hans: 完成

source: Drag window slightly before switching
zh_hans: 在切换窗口前轻微拖动

source: Edit Exception
zh_hans: 编辑特例

source: Enable switch gesture override
zh_hans: 启用切换手势覆盖

source: Enabled
zh_hans: 已启用

source: Enter Full Screen
zh_hans: 进入全屏

source: Error locating exception
zh_hans: 加载特例出错

source: Exceptions
zh_hans: 特例

source: Executing batch window moves...
zh_hans: 执行批量窗口移动...

source: Exit Full Screen
zh_hans: 退出全屏

source: Factory reset
zh_hans: 恢复出厂设置

source: Faster Switching Override
zh_hans: 更快的切换

source: Focus
zh_hans: 切换

source: Focus ↵
zh_hans: 聚焦 ↵

source: Font size
zh_hans: 字体大小

source: For custom-drawn windows (like WeChat) that require mouse movement to start dragging. Enabling this may resolve some window movement failures.
zh_hans: 对于自建套件的窗口（如微信），需要轻微拖动窗口才能跨桌面移动。启用可以解决部分失败。

source: Force refresh all space name labels on displays
zh_hans: 强制刷新显示器上的所有桌面名称标签

source: Fullscreen
zh_hans: 全屏

source: Gesture type
zh_hans: 手势类型

source: Get Started
zh_hans: 开始使用

source: GitHub / Support
zh_hans: GitHub / 支持

source: Grab offset X
zh_hans: 抓取 X 坐标

source: Grab offset Y
zh_hans: 抓取 Y 坐标

source: Grabbing
zh_hans: 抓取

source: Grant
zh_hans: 授权

source: Hidden
zh_hans: 隐藏

source: Hide
zh_hans: 隐藏

source: Hide menubar icon
zh_hans: 隐藏菜单栏图标

source: Hide the space label window of the space that is being switched to immediately instead of hiding it after the space is switched.
zh_hans: 在切换桌面时，立即隐藏桌面标签窗口，而非切换结束后隐藏。

source: Hide when switching spaces
zh_hans: 切换时隐藏

source: Hold the Option key while swiping on the trackpad to move the active window to the adjacent space.
zh_hans: 切换时按住Option将当前窗口移动到相邻桌面。

source: If enabled, the label stays on the desktop instead of hiding. If disabled, the label will only be visible in Mission Control. Tip: You can drag the window to the screen edge to shrink it into a 'Picture-in-Picture' mode.
zh_hans: 如果启用，标签将会在桌面可见区域显示。 如果禁用，标签会在调度中心的角落显示。 提示：你可以将标签拖至桌面边缘以最小化。

source: If the Settings show that the permission is granted but the app still does not have the permission, remove the app row in Settings and re-grant.
zh_hans: 如果设置显示权限已获取但是 App 显示未获取，在设置权限中移除 App 并重新获取权限。

source: If you want to use Control + Arrow, disable the system's one in Settings → Keyboard → Keyboard Shortcuts... → Mission Control.
zh_hans: 如果使用 Control + 箭头切换，需要在系统设置 → 键盘 → 键盘快捷键 → 调度中心中关闭系统快捷键。

source: Install Raycast Extension
zh_hans: 安装 Raycast 拓展

source: Keep visible on desktop
zh_hans: 显示在桌面

source: Keep visible on desktop: %@
zh_hans: 保持在桌面可见：%@

source: Keep visible on space
zh_hans: 在桌面可见

source: Keyboard Shortcuts
zh_hans: 键盘快捷键

source: Launcher Commands Ranking
zh_hans: 启动器命令排序

source: Launcher Settings
zh_hans: 启动器设置

source: Launcher...
zh_hans: 启动器…

source: Let you right-click with the Option key.
zh_hans: 用 Option 键模拟右键。

source: Likely working: Draggable (%@)
zh_hans: 可能可用：可以拖拽 (%@)

source: Links
zh_hans: 链接

source: List Windows
zh_hans: 窗口列表

source: Lock current space
zh_hans: 锁定当前桌面

source: Lock Current Space
zh_hans: 锁定当前桌面

source: Lock Your Spaces
zh_hans: 锁定您的桌面

# Menu.Quit
source: Quit
zh_hans: 退出

# Menu.RenameCurrentSpace
source: Rename Current Space
zh_hans: 重命名当前桌面

# Menu.Settings
source: Settings...
zh_hans: 设置...

# Menu.ShowActiveLabels
source: Show Active Space Labels
zh_hans: 显示当前桌面标签

# Menu.ShowPreviewLabels
source: Show Preview Labels
zh_hans: 显示预览标签

source: Minimize
zh_hans: 最小化

source: Minimized
zh_hans: 最小化

source: More Apps
zh_hans: 更多 App

source: Move
zh_hans: 移动

source: Move the active window to a selected space
zh_hans: 将当前活跃窗口移动到选中的桌面

source: Move to %@
zh_hans: 移动至%@

source: Move to...
zh_hans: 加入移动队列…

source: Move Window
zh_hans: 移动窗口

source: Move Window to Desktop
zh_hans: 将窗口移至桌面

source: Move window to next display
zh_hans: 将窗口移至下个显示器

source: Move window to next space
zh_hans: 将窗口移至下个桌面

source: Move window to previous display
zh_hans: 将窗口移至上个显示器

source: Move window to previous space
zh_hans: 将窗口移至上个桌面

source: Move window to space number
zh_hans: 将窗口移至桌面n

source: Move window to...
zh_hans: 将窗口移至…

source: Move window when holding Option
zh_hans: 按住Option以移动窗口

source: Move: %@
zh_hans: 移动: %@

source: Moving window failed for %@
zh_hans: 移动%@窗口失败

# My GitHub
source: Author’s GitHub
zh_hans: 作者的GitHub

# My website
source: Author’s website
zh_hans: 作者的网站

source: New Space Name...
zh_hans: 新桌面名称...

source: Next
zh_hans: 继续

source: No commands found
zh_hans: 无相关命令

source: No commands matched your search query.
zh_hans: 没有指令符合搜索。

source: No editable spaces (fullscreen only)
zh_hans: 无可编辑桌面（只有全屏）

source: No per-app exceptions defined. Standard grab offsets will be used for all apps.
zh_hans: 无App特例。标准抓取位置会用于所有App。

source: No results
zh_hans: 无结果

source: No visible window found
zh_hans: 未找到可用窗口

source: No visible window found for %@. Please open a window of the app and make it visible.
zh_hans: 未找到%@的可用窗口。请打开一个该App的窗口并让它可见。

source: Open launcher
zh_hans: 打开启动器

source: Option + Click to Move
zh_hans: Option + 点击以移动窗口

source: Permissions
zh_hans: 权限

source: Pin space label on desktop or hide on apps
zh_hans: 将桌面标签固定在桌面上，或在打开应用时隐藏

source: Press modifiers and a number to set the shortcut.
zh_hans: 按下修饰键及一个数字键来设置该快捷键。

source: Prevent applications or macOS from automatically switching spaces. Keep your workspace focused by locking important desktops.
zh_hans: 防止应用程序或 macOS 自动切换桌面。通过锁定重要桌面来保持您的工作区专注。

source: Preview Label
zh_hans: 预览标签

source: Preview Labels
zh_hans: 预览标签

source: Preview Position
zh_hans: 预览位置

source: Preview Space Labels: %@
zh_hans: 预览桌面标签：%@

source: Quickly give your desktop spaces a custom name directly from the menu bar.
zh_hans: 快速在菜单栏重命名桌面。

source: Quit
zh_hans: 退出

source: Raycast Integration
zh_hans: Raycast 集成

source: Raycast: Batch Move
zh_hans: Raycast: 批量移动窗口

source: Reload space labels
zh_hans: 重新加载桌面标签

source: Reload Space Labels
zh_hans: 重新加载桌面标签

source: Rename at Menu Bar
zh_hans: 在菜单栏重命名

source: Rename Current Space
zh_hans: 重命名当前桌面

source: Rename Space
zh_hans: 重命名桌面

source: Rename the current space to a new label
zh_hans: 重命名当前桌面空间的标签名称

# Rename.Label
source: Rename Desktop %d
zh_hans: 重命名桌面 %d

# Rename.Placeholder
source: Enter space name
zh_hans: 输入桌面名称

source: Replaces system switch gestures with instant space switching. Required: You must disable 'Swipe between full screen apps' in System Settings → Trackpad → More Gestures or change to different number of fingers to prevent conflicts. Notice, you must click at the fullscreen app to make it active to avoid issues when leaving the app.
zh_hans: 替换缓慢的系统切换手势，使用 DesktopRenamer 的更快切换方法。 要求：必须在系统设置 → 触控板 → 更多手势中取消默认的切换手势或选择不同数量的手指。 在你切换到全屏App时，请点击App以保证切出App时不会出现问题。

source: Report an issue
zh_hans: 反馈

source: Require Permissions
zh_hans: 权限

source: Required for injecting shortcuts to switch spaces, and reading active window information.
zh_hans: 在切换桌面，获取当前桌面时需要此权限。

source: Requires Accessibility permission.
zh_hans: 需要辅助权限。

source: Reset
zh_hans: 重置

source: Reset & Quit
zh_hans: 重置并退出

source: Reset to default
zh_hans: 重置默认

source: Restore
zh_hans: 恢复

source: Restore to %@
zh_hans: 恢复至%@

source: Restore to...
zh_hans: 恢复至...

source: Restore windows moved by lock
zh_hans: 恢复被锁定移动的窗口

source: Restore Windows Moved by Lock (%d)
zh_hans: 恢复被锁定移动的窗口 (%d)

source: Restore windows moved by lock to the last space that windows are manually assigned to.
zh_hans: 将因锁定而被移动的窗口恢复到上次手动分配的桌面。

source: Review
zh_hans: 浏览

source: Review splash
zh_hans: 浏览介绍

source: Run ↵
zh_hans: 执行 ↵

source: Run Batch Actions
zh_hans: 批量操作

source: Search
zh_hans: 搜索

source: Search and manage open application windows
zh_hans: 搜索并管理打开的应用窗口

source: Search commands...
zh_hans: 搜索命令...

source: Search items...
zh_hans: 搜索项目...

source: Search target space...
zh_hans: 搜索目标桌面...

source: See large, aesthetic name labels when you enter Mission Control, and discreet active labels when you switch spaces.
zh_hans: 位于调度中心的大而美标签，以及当前桌面的小标签。

source: Select a desktop to switch to
zh_hans: 选择要切换的桌面

source: Select an active application below to add it as an exception.
zh_hans: 选择正在运行的App定义特例。

source: Select and move multiple windows to a space
zh_hans: 选择多个窗口并将其移动到指定桌面

source: Set to 0 for instant switching (bypasses the macOS sliding animation). Otherwise the velocity is calibrated per display (cached across restarts) so the actual switch time converges to this value.
zh_hans: 设为0以跳过切换动画。否则切换速度会反复调整直到达到目标时长，可能需要多次切换。

source: Settings
zh_hans: 设置

# Settings.About
source: About
zh_hans: 关于

# Settings.General
source: General
zh_hans: 通用

# Settings.General.Advanced
source: Advanced
zh_hans: 高级

# Settings.General.Advanced.EnableAPI
source: Enable SpaceAPI
zh_hans: 启用桌面 API

# Settings.General.General
source: General
zh_hans: 通用

# Settings.General.General.LaunchAtLogin
source: Launch at login
zh_hans: 登录时启动

# Settings.General.Reset
source: Reset
zh_hans: 重置

# Settings.General.Reset.Alert.Info
source: Are you sure you want to reset all desktop names to their defaults?
zh_hans: 确定要将所有桌面名称重置为默认值吗？

# Settings.General.Reset.Alert.Msg
source: Reset Desktop Names
zh_hans: 重置桌面名称

# Settings.General.Reset.Alert.Reset
source: Reset
zh_hans: 重置

# Settings.General.Reset.Success.Info
source: All space names have been reset to their default values
zh_hans: 所有桌面名称已重置

# Settings.General.Reset.Success.Msg
source: Reset successful
zh_hans: 重置成功

# Settings.General.Update
source: Update
zh_hans: 更新

# Settings.General.Updates
source: Updates
zh_hans: 更新

# Settings.General.Updates.AutoCheckUpdate
source: Automatically check for updates
zh_hans: 自动检查更新

# Settings.General.Updates.Button
source: Check
zh_hans: 检查

# Settings.General.Updates.ManualCheck
source: Check for updates
zh_hans: 检查更新

# Settings.Labels
source: Labels
zh_hans: 标签

# Settings.Launcher
source: Launcher
zh_hans: 启动器

# Settings.Launcher.Command.Actions
source: Actions
zh_hans: 操作

# Settings.Launcher.Command.Name
source: Command
zh_hans: 命令

# Settings.Shortcuts.Hotkey.PressNew
source: Press New
zh_hans: 新快捷键

# Settings.Shortcuts.Unassgined
source: Unassigned
zh_hans: 未分配

# Settings.Spaces
source: Spaces
zh_hans: 桌面

# Settings.Spaces.Edit
source: Edit Spaces
zh_hans: 编辑桌面

# Settings.Spaces.Edit.Actions
source: Actions
zh_hans: 操作

# Settings.Spaces.Edit.Empty.Hint
source: Your desktop spaces will appear here
zh_hans: 你的桌面空间将显示在此处

# Settings.Spaces.Edit.Empty.Title
source: No Spaces Available
zh_hans: 没有可用桌面

# Settings.Spaces.Edit.Name
source: Name
zh_hans: 名称

# Settings.Switch
source: Switch
zh_hans: 切换

source: Shortcuts
zh_hans: 快捷键

source: Show active space labels
zh_hans: 显示当前桌面标签

source: Show or hide the active space label overlay
zh_hans: 显示或隐藏当前桌面的标签悬浮窗

source: Show or hide the preview space labels overlay
zh_hans: 显示或隐藏预览桌面的标签悬浮窗

source: Show preview labels
zh_hans: 显示预览标签

source: Space Labels Reloaded
zh_hans: 桌面标签已重新加载

# Space.DefaultName
source: Desktop %d
zh_hans: 桌面 %d

source: Spaces:
zh_hans: 桌面：

source: Stage
zh_hans: 暂存

source: Stage: %@
zh_hans: 暂存：%@

source: Staged Moves (Pending)
zh_hans: 暂存的移动（待执行）

source: Stop Preview
zh_hans: 停止预览

source: Switch & Move
zh_hans: 切换 & 移动

source: Switch ↵
zh_hans: 切换 ↵

source: Switch Desktop
zh_hans: 切换桌面

source: Switch display with
zh_hans: 切换屏幕条件

source: Switch duration
zh_hans: 切换时长

# Switch override threshold
source: Switch distance
zh_hans: 滑动距离

source: Switch Space
zh_hans: 切换桌面

source: Switch to next space
zh_hans: 切换至下个桌面

source: Switch to previous space
zh_hans: 切换至上个桌面

source: Switch to space number
zh_hans: 切换至桌面n

# Switch to... (press ⌥ for more)
source: Switch to… (press ⌥ to move window)
zh_hans: 切换到… (按下⌥移动窗口)

source: Take back control of your macOS spaces.
zh_hans: 优雅地使用mac桌面。

# The hidden label that slides into the corner of the active desktop.
source: The hidden label that slides into the corner of the active desktop. Only appears in Mission Control.
zh_hans: 在桌面角落的隐藏标签，仅在调度中心显示。

source: The large label visible in Mission Control.
zh_hans: 调度中心预览的大标签。

source: Toggle Active Space Label
zh_hans: 切换显示当前桌面标签

source: Toggle Active Space Label Visibility
zh_hans: 切换当前桌面标签是否可见

source: Toggle lock for current space
zh_hans: 切换当前桌面锁定

source: Toggle Preview Space Label
zh_hans: 切换显示预览桌面标签

source: Trackpad Switch Gesture Override
zh_hans: 触控板切换手势覆盖

source: Type a new name above and press Enter to save
zh_hans: 输入新名称并回车

source: Unlock space
zh_hans: 解锁桌面

source: Use ← → ↑ ↓ to fine-tune, Esc to exit
zh_hans: 使用 ← → ↑ ↓ 调整位置, Esc 退出

source: Use the Raycast extension to move all windows of an app to another space in one command.
zh_hans: 用 Raycast 拓展快速移动窗口到指定的桌面。

source: View the welcome screen again.
zh_hans: 重新观看欢迎界面。

source: Welcome to
zh_hans: 欢迎使用

source: When a space switch is triggered by opening the window of an app, move that window back to the original space. This way, you are always focused in the locked space.
zh_hans: 当打开某个应用程序的窗口触发桌面切换时，将该窗口移回原桌面。这样，您将始终专注于锁定的桌面。

source: When set to 3 fingers, you can still use 4 fingers to trigger native swipe.
zh_hans: 设置为3指时，仍可以4指使用系统原生切换。

source: Window size
zh_hans: 窗口大小
